/**
  ******************************************************************************
  * @file    exti.h
  * @author  FZetc飞贼
  * @version V0.0.1
  * @date    2025.10.20
  * @brief   1、外部中断0234线初始化  
  *          2、外部中断控制蜂鸣器
  *
  ******************************************************************************
  * @attention
  *	
  *	本文档只供学习使用，不得商用，违者必究
  *
  * 微信公众号：    FZetc飞贼
  * CSDN博客：      https://blog.csdn.net/qq_58629108?type=blog
  * 有疑问或者建议： FZetcSnitch@163.com
  *
  ******************************************************************************
  */

#ifndef __EXTI_H		// 定义以防止递归包含
#define __EXTI_H


// 一、其它头文件
#include "stm32f4xx.h"
#include "my_config.h"
#include "my_reg.h"

// 二、宏定义(函数、变量、常量)

// 三、自定义的数据类型(结构体、联合体、枚举等)

// 四、全局变量声明

// 五、函数声明
extern void EXTI8_HS0038_Init(void);

// 六、静态变量、函数定义

#endif /* __EXTI_H */

